PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
void testAuthCookie() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");
  client.cookie("session_id", "abc123")
        .cookie("device_id", "esp32-01");

  expectEqInt(static_cast<long long>(client._headers.size()), 1, "headers size after multiple cookies should be 1 (appended)");
  expectEq(client._headers[0].name, "Cookie", "cookie header name");
  expectEq(client._headers[0].value, "session_id=abc123; device_id=esp32-01", "cookie header value correctly formatted");

  int val = 0;
  client.get("/api/v1").getBody("v", &val);

  bool found = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Cookie" && h.second == "session_id=abc123; device_id=esp32-01") {
      found = true;
      break;
    }
  }
  expectTrue(found, "Cookie header should be sent with request");
}

void testObservability() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  bool callbackFired = false;
  client.onObservability([&callbackFired](const ObservabilityMetrics& metrics) {
    callbackFired = true;
    expectTrue(metrics.totalTimeMs >= 0, "Total time should be tracked");
    expectTrue(metrics.ttfbMs >= 0, "TTFB should be tracked");
    expectTrue(metrics.txBytes > 0, "TX bytes should be > 0");
    expectEqInt(static_cast<long long>(metrics.rxBytes), 11, "RX bytes should match response size");
    expectEqInt(metrics.retries, 0, "Retries should be 0");
    expectTrue(metrics.freeHeapBefore > 0, "Free heap before should be > 0");
    expectTrue(metrics.freeHeapAfter > 0, "Free heap after should be > 0");
  });

  HttpClientStub::setResponse(200, R"({"ok":true})");
  client.get("/api").execute();

  expectTrue(callbackFired, "Observability callback should have been fired");
}

void testAuthEdgeCases() {
  ESP32HTTPClient client("https://example.com");
  client.bearer(nullptr);
  expectEq(client._headers[0].value, "Bearer ", "bearer with null token");

  client.basic(nullptr, nullptr);
  expectEq(client._headers[0].value, "Basic Og==", "basic with null creds");

  client.apiKey("X-Custom-Key", nullptr);
  expectEq(client._headers[1].value, "", "apiKey with null key");
}

void testQueryParameters() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  int id = 0;
  client.get("/users")
      .query("page", 2)
      .query("limit", 20)
      .query("search", "pedro")
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/users?page=2&limit=20&search=pedro", "query params built in url");

  HttpClientStub::reset();
  client.get("/sensors")
      .query("active", true)
      .query("threshold", 4.5f)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/sensors?active=true&threshold=4.5", "typed query params built in url");
}

void testPathParameters() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  int id = 0;
  client.get("/users/{id}")
      .path("id", 15)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/users/15", "path parameter {id} replaced with 15");

  HttpClientStub::reset();
  client.get("/users/{id}")
      .path("{id}", 15)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/users/15", "path parameter with explicit {id} format");

  HttpClientStub::reset();
  client.get("/orgs/{org}/users/{userId}/posts/{postId}")
      .path("org", "google")
      .path("userId", 42)
      .path("postId", 101)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/orgs/google/users/42/posts/101", "multiple path parameters");

  HttpClientStub::reset();
  client.get("/devices/{uuid}/telemetry")
      .path("uuid", "123e4567-e89b-12d3-a456-426614174000")
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/devices/123e4567-e89b-12d3-a456-426614174000/telemetry", "uuid path parameter");
}

void testPathAndQueryCombined() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  int id = 0;
  client.get("/users/{id}/orders")
      .path("id", 15)
      .query("page", 2)
      .query("limit", 20)
      .query("search", "pedro")
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/users/15/orders?page=2&limit=20&search=pedro", "combined path and query params");
}

void testPathEdgeCases() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  int id = 0;
  client.get("/static/path")
      .path("none", 123)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com/static/path", "path without placeholders unaffected");

  HttpClientStub::reset();
  client.get(nullptr)
      .path("id", 10)
      .getBody("id", &id);

  expectEq(HttpClientStub::lastUrl, "https://example.com", "null path handled safely");

  HttpClientStub::reset();
  {
    RestRequest req1(&client, "/users/{id}", HTTP_GET_METHOD);
    req1.path("id", 99);
    RestRequest req2(std::move(req1));
    req2.getBody("id", &id);
  }
  expectEq(HttpClientStub::lastUrl, "https://example.com/users/99", "move constructor preserves path params");
}

void testRuntimeUrlChange() {
  ESP32HTTPClient client("https://api.initial.com", 80);
  expectEq(client.getBaseUrl(), "https://api.initial.com", "initial baseUrl");
  expectEqInt(client.getPort(), 80, "initial port");

  HttpClientStub::reset();
  int id = 0;
  client.get("/users").getBody("id", &id);
  expectEq(HttpClientStub::lastUrl, "https://api.initial.com:80/users", "request to initial url");

  client.setBaseUrl("https://api.newhost.org", 443);
  expectEq(client.getBaseUrl(), "https://api.newhost.org", "updated baseUrl");
  expectEqInt(client.getPort(), 443, "updated port");

  HttpClientStub::reset();
  client.get("/v1/data").getBody("id", &id);
  expectEq(HttpClientStub::lastUrl, "https://api.newhost.org:443/v1/data", "request to updated url and port");

  client.setUrl("http://192.168.1.50");
  client.setPort(8080);
  HttpClientStub::reset();
  client.get("/sensors").getBody("id", &id);
  expectEq(HttpClientStub::lastUrl, "http://192.168.1.50:8080/sensors", "request after setUrl and setPort");
}

