PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
void testStringAndNumericTypesInParams() {
  ESP32HTTPClient client("https://jsonplaceholder.typicode.com");

  String title = "asd";
  String desc = "test-desc";
  String route = "items";
  String idStr = "42";

  RestRequest req(&client, "/{route}/{id}", HTTP_POST_METHOD);
  req.path("route", route)
     .path("id", idStr)
     .query("filter", String("active"))
     .query("u_int", 500u)
     .query("u_long", 12345678UL)
     .query("i64", 9876543210LL)
     .query("u64", 18446744073709551615ULL)
     .body("title", title)
     .body("desc", String("inline-string"))
     .body("u_int", 42u)
     .body("u_long", 99999999UL)
     .body("i64", 12345678901234LL)
     .body("u64", 99999999999999ULL);

  expectEqInt(static_cast<long long>(req._pathParams.size()), 2, "path params count");
  expectEq(req._pathParams[0].valueBuffer, "items", "String path param route");
  expectEq(req._pathParams[1].valueBuffer, "42", "String path param id");

  expectEqInt(static_cast<long long>(req._queryParams.size()), 5, "query params count");
  expectEq(req._queryParams[0].valueBuffer, "active", "String query param");
  expectTrue(req._queryParams[0].quoteValue, "String query quoteValue is true");
  expectEq(req._queryParams[1].valueBuffer, "500", "unsigned int query param");
  expectEq(req._queryParams[2].valueBuffer, "12345678", "unsigned long query param");
  expectEq(req._queryParams[3].valueBuffer, "9876543210", "long long query param");
  expectEq(req._queryParams[4].valueBuffer, "18446744073709551615", "unsigned long long query param");

  expectEqInt(static_cast<long long>(req._bodyParams.size()), 6, "body params count");
  expectEq(req._bodyParams[0].valueBuffer, "asd", "String body param");
  expectTrue(req._bodyParams[0].quoteValue, "String body quoteValue is true");
  expectEq(req._bodyParams[1].valueBuffer, "inline-string", "temporary String body param");
  expectTrue(req._bodyParams[1].quoteValue, "temporary String body quoteValue is true");
  expectEq(req._bodyParams[2].valueBuffer, "42", "unsigned int body param");
  expectTrue(!req._bodyParams[2].quoteValue, "unsigned int body quoteValue is false");
  expectEq(req._bodyParams[3].valueBuffer, "99999999", "unsigned long body param");
  expectTrue(!req._bodyParams[3].quoteValue, "unsigned long body quoteValue is false");
  expectEq(req._bodyParams[4].valueBuffer, "12345678901234", "long long body param");
  expectTrue(!req._bodyParams[4].quoteValue, "long long body quoteValue is false");
  expectEq(req._bodyParams[5].valueBuffer, "99999999999999", "unsigned long long body param");
  expectTrue(!req._bodyParams[5].quoteValue, "unsigned long long body quoteValue is false");

  req._executed = true;

  // Test full POST execution with String body param (exact user reproduction)
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"success\":true}");
  {
    String postTitle = "asd";
    client.post("/todos/1")
          .body("title", postTitle);
  }
  expectEq(HttpClientStub::lastMethod, "POST", "POST method called");
  expectEq(HttpClientStub::lastUrl, "https://jsonplaceholder.typicode.com/todos/1", "POST url");
  expectEq(HttpClientStub::lastPayload, "{\"title\":\"asd\"}", "POST payload matches user example");

  // Test getBody char array overload
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"name\":\"device-1\"}");
  char nameBuffer[32] = {0};
  client.get("/device").getBody("name", nameBuffer);
  expectEq(nameBuffer, "device-1", "getBody into char array buffer");
}

void testBase64EncodeEdgeCases() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");

  // Length % 3 == 2: "use:p" -> 5 characters -> "dXNlOnA="
  client.basic("use", "p");
  expectEqInt(static_cast<long long>(client._headers.size()), 1, "basic auth header added for len % 3 == 2");
  expectEq(client._headers[0].value, "Basic dXNlOnA=", "base64 encoding with len % 3 == 2");

  // Length % 3 == 1: "a:bc" -> 4 characters -> "YTpiYw=="
  client.basic("a", "bc");
  expectEq(client._headers[0].value, "Basic YTpiYw==", "base64 encoding with len % 3 == 1");

  // Length % 3 == 0: "ab:def" -> 6 characters -> "YWI6ZGVm"
  client.basic("ab", "def");
  expectEq(client._headers[0].value, "Basic YWI6ZGVm", "base64 encoding with len % 3 == 0");
}

void testCookieNullParams() {
  ESP32HTTPClient client("https://example.com");
  client.cookie(nullptr, "value");
  client.cookie("name", nullptr);
  client.cookie(nullptr, nullptr);
  expectEqInt(static_cast<long long>(client._headers.size()), 0, "null cookie name/value should not add header");
}

void testErrorToStringAllCodes() {
  expectEq(ESP32HTTPClient::errorToString(-1).c_str(), "Connection Refused", "-1");
  expectEq(ESP32HTTPClient::errorToString(-2).c_str(), "Send Header Failed", "-2");
  expectEq(ESP32HTTPClient::errorToString(-3).c_str(), "Send Payload Failed", "-3");
  expectEq(ESP32HTTPClient::errorToString(-4).c_str(), "Not Connected", "-4");
  expectEq(ESP32HTTPClient::errorToString(-5).c_str(), "Connection Lost", "-5");
  expectEq(ESP32HTTPClient::errorToString(-6).c_str(), "No Stream", "-6");
  expectEq(ESP32HTTPClient::errorToString(-7).c_str(), "No HTTP Server", "-7");
  expectEq(ESP32HTTPClient::errorToString(-8).c_str(), "Too Less RAM", "-8");
  expectEq(ESP32HTTPClient::errorToString(-9).c_str(), "Encoding Error", "-9");
  expectEq(ESP32HTTPClient::errorToString(-10).c_str(), "Stream Write Error", "-10");
  expectEq(ESP32HTTPClient::errorToString(-11).c_str(), "Read Timeout", "-11");

  expectEq(ESP32HTTPClient::errorToString(200).c_str(), "OK", "200");
  expectEq(ESP32HTTPClient::errorToString(201).c_str(), "Created", "201");
  expectEq(ESP32HTTPClient::errorToString(202).c_str(), "Accepted", "202");
  expectEq(ESP32HTTPClient::errorToString(204).c_str(), "No Content", "204");

  expectEq(ESP32HTTPClient::errorToString(400).c_str(), "Bad Request", "400");
  expectEq(ESP32HTTPClient::errorToString(401).c_str(), "Unauthorized", "401");
  expectEq(ESP32HTTPClient::errorToString(403).c_str(), "Forbidden", "403");
  expectEq(ESP32HTTPClient::errorToString(404).c_str(), "Not Found", "404");
  expectEq(ESP32HTTPClient::errorToString(405).c_str(), "Method Not Allowed", "405");
  expectEq(ESP32HTTPClient::errorToString(408).c_str(), "Request Timeout", "408");
  expectEq(ESP32HTTPClient::errorToString(409).c_str(), "Conflict", "409");
  expectEq(ESP32HTTPClient::errorToString(429).c_str(), "Too Many Requests", "429");

