PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  expectEq(ESP32HTTPClient::errorToString(500).c_str(), "Internal Server Error", "500");
  expectEq(ESP32HTTPClient::errorToString(501).c_str(), "Not Implemented", "501");
  expectEq(ESP32HTTPClient::errorToString(502).c_str(), "Bad Gateway", "502");
  expectEq(ESP32HTTPClient::errorToString(503).c_str(), "Service Unavailable", "503");
  expectEq(ESP32HTTPClient::errorToString(504).c_str(), "Gateway Timeout", "504");
  expectEq(ESP32HTTPClient::errorToString(0).c_str(), "Not Executed", "0");

  expectEq(ESP32HTTPClient::errorToString(-99).c_str(), "Unknown Client Error", "-99");
  expectEq(ESP32HTTPClient::errorToString(299).c_str(), "Success", "299");
  expectEq(ESP32HTTPClient::errorToString(302).c_str(), "Redirection", "302");
  expectEq(ESP32HTTPClient::errorToString(418).c_str(), "Client Error", "418");
  expectEq(ESP32HTTPClient::errorToString(599).c_str(), "Server Error", "599");
  expectEq(ESP32HTTPClient::errorToString(600).c_str(), "Unknown HTTP Status", "600");
}

void testClientAndRequestSingleParamOnError() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(500, "error");
  ESP32HTTPClient client("https://example.com");

  int clientErrCode = 0;
  HttpResponseCallback cbClient = [&](int code) {
    clientErrCode = code;
  };
  client.onError(cbClient);
  client.get("/test");
  expectEqInt(clientErrCode, 500, "client single-param onError invoked");

  client.onError(static_cast<HttpResponseCallback>(nullptr));
  expectTrue(!client._onErrorCb, "client onError cleared");

  int reqErrCode = 0;
  HttpResponseCallback cbReq = [&](int code) {
    reqErrCode = code;
  };
  {
    RestRequest req = client.get("/test");
    req.onError(cbReq);
  }
  expectEqInt(reqErrCode, 500, "request single-param onError invoked");

  RestRequest req2 = client.get("/test");
  req2.onError(static_cast<HttpResponseCallback>(nullptr));
  req2._executed = true;
  expectTrue(!req2._onErrorCb, "request onError cleared");
}

void testClientErrorCallbackTriggered() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(404, "not found");
  ESP32HTTPClient client("https://example.com");
  int capturedCode = 0;
  std::string capturedMsg;
  client.onError([&](int code, const char* msg) {
    capturedCode = code;
    capturedMsg = msg ? msg : "";
  });

  client.get("/missing");
  expectEqInt(capturedCode, 404, "client 2-param onError code");
  expectEq(capturedMsg, "Not Found", "client 2-param onError msg");
}

void testRetryWithClientHeadersAndBody() {
  HttpClientStub::reset();
  HttpClientStub::queueResponse(-1, "");
  HttpClientStub::queueResponse(200, "{\"ok\":true}");

  ESP32HTTPClient client("https://example.com");
  client.setHeader("X-Custom", "Val");
  client.setContentType("application/json");

  {
    RestRequest req = client.post("/items");
    req.maxRetry(1);
    req.body("name", "item1");
  }

  expectEqInt(client.getStatusCode(), 200, "status code 200 after retry");
  expectEqInt(HttpClientStub::requestCount, 2, "2 attempts made");
}

void testExecuteNullClient() {
  RestRequest req(nullptr, "/path", HTTP_GET_METHOD);
  req.execute();
  expectTrue(req._executed, "executed flag set for null client");
}

void testRawJsonRootObjectAndEscapedStrings() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"msg\": \"hello \\\"world\\\" \\\\ test\", \"num\": 123}");

  ESP32HTTPClient client("https://example.com");
  String rawJson;
  client.get("/data").getBody("", &rawJson);

  expectEq(rawJson.c_str(), "{\"msg\": \"hello \\\"world\\\" \\\\ test\", \"num\": 123}", "raw JSON root object captured with escaped chars");
}

void testParsePrimitiveEdgeCases() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"d_null\": null, \"l_null\": null, \"str_int\": \"1234\", \"num_str\": 9876}");

  ESP32HTTPClient client("https://example.com");
  double dVal = 123.45;
  long lVal = 999L;
  int strIntVal = 0;
  String numStrVal;

  client.get("/primitives")
        .getBody("d_null", &dVal)
        .getBody("l_null", &lVal)
        .getBody("str_int", &strIntVal)
        .getBody("num_str", &numStrVal);

  expectNear(dVal, 0.0, 0.001, "null double set to 0.0");
  expectEqInt(lVal, 0L, "null long set to 0L");
  expectEqInt(strIntVal, 1234, "string coerced to int");
  expectEq(numStrVal.c_str(), "9876", "number coerced to Arduino String");
}

void testArrayBindingsAdvanced() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "[10, 20, 30]");

  ESP32HTTPClient client("https://example.com");
  int item0 = 0, item1 = 0, item2 = 0;
  client.get("/array")
        .getBody("0", &item0)
        .getBody("1", &item1)
        .getBody("2", &item2);

  expectEqInt(item0, 10, "array[0] primitive");
  expectEqInt(item1, 20, "array[1] primitive");
  expectEqInt(item2, 30, "array[2] primitive");

  // Raw array element
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "[{\"a\":1}, {\"b\":2}]");
  String elem0;
  client.get("/raw_array_elem")
        .getBody("0", &elem0);
  expectEq(elem0.c_str(), "{\"a\":1}", "array element raw json string");

  // Nested array in array
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "[[100, 200], [300, 400]]");
  int nestedVal = 0;
  client.get("/nested_array")
        .getBody("1.0", &nestedVal);
  expectEqInt(nestedVal, 300, "nested array element 1.0");
}

void testSkipValueObjectAndArray() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"skip_obj\": {\"a\": 1, \"b\": \"str with \\\"quote\\\" and \\\\ slash\", \"nested\": [10, 20]}, \"skip_arr\": [{\"x\": true}, [1, 2]], \"keep\": 42}");

  ESP32HTTPClient client("https://example.com");
  int keep = 0;
  client.get("/skip")
        .getBody("keep", &keep);

  expectEqInt(keep, 42, "unmapped complex object and array skipped properly");
}

void testMalformedJsonHandling() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"badkey\" 123, \"goodkey\": 456}");

  ESP32HTTPClient client("https://example.com");
  int good = 0;
  client.get("/malformed")
        .getBody("goodkey", &good);

  expectEqInt(good, 456, "malformed key missing colon is skipped");
}

class MockDirectStream : public Stream {
 public:
  std::string data;
  size_t cursor = 0;
  bool availableTimesOut = false;
  int availableLimit = -1;
  int readBytesLimit = -1;
  bool simulateZeroBytesRead = false;

  explicit MockDirectStream(const std::string& d = "") : data(d), cursor(0) {}

  int available() override {
    if (availableTimesOut) return 0;
    if (availableLimit >= 0) {
      if (availableLimit > 0) {
        availableLimit--;
        return static_cast<int>(data.size() - cursor);
      }
      return 0;
    }
    return cursor < data.size() ? static_cast<int>(data.size() - cursor) : 0;
  }

  int read() override {
    if (cursor < data.size()) {
      return static_cast<unsigned char>(data[cursor++]);
    }
    return -1;
  }

