PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  int peek() override {
    if (cursor < data.size()) {
      return static_cast<unsigned char>(data[cursor]);
    }
    return -1;
  }

  size_t readBytes(char* buffer, size_t length) override {
    if (simulateZeroBytesRead) {
      simulateZeroBytesRead = false;
      return 0;
    }
    size_t toRead = length;
    if (readBytesLimit >= 0 && toRead > static_cast<size_t>(readBytesLimit)) {
      toRead = static_cast<size_t>(readBytesLimit);
    }
    size_t avail = cursor < data.size() ? data.size() - cursor : 0;
    if (toRead > avail) toRead = avail;
    for (size_t i = 0; i < toRead; i++) {
      buffer[i] = data[cursor++];
    }
    return toRead;
  }
};

struct NullStrStruct {
  const char* text = nullptr;
  REST_JSON_MAP(
    REST_FIELD(text)
  )
};

void testStructNullStringField() {
  NullStrStruct s;
  String json = ESP32HTTPClient::toJson(s);
  expectEq(json.c_str(), "{\"text\":null}", "null string field serializes to null");
}

void testSkipValueEscapedString() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"skip_str\": \"hello \\\"world\\\" \\\\ test\", \"keep\": 123}");
  ESP32HTTPClient client("https://example.com");
  int keep = 0;
  client.get("/skip_esc").getBody("keep", &keep);
  expectEqInt(keep, 123, "skipValue skips escaped string");
}

void testObjectWithNestedArrayChildBinding() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"items\": [100, 200], \"flag\": true}");
  ESP32HTTPClient client("https://example.com");
  int item0 = 0;
  bool flag = false;
  client.get("/nested_arr_in_obj")
        .getBody("items.0", &item0)
        .getBody("flag", &flag);
  expectEqInt(item0, 100, "items.0 extracted from object");
  expectTrue(flag, "flag extracted");
}

void testBufferedStreamReaderDirect() {
  // Non-chunked with custom stream
  MockDirectStream directStream("{\"val\":\"H\"}");
  HttpClientStub::reset();
  HttpClientStub::customStream = &directStream;
  HttpClientStub::customSize = static_cast<int>(directStream.data.size());
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/test").getBody("val", &val);
    expectEq(val.c_str(), "H", "custom directStream read");
  }

  // Timeout in non-chunked refill
  MockDirectStream timeoutStream;
  timeoutStream.availableTimesOut = true;
  HttpClientStub::reset();
  HttpClientStub::customStream = &timeoutStream;
  HttpClientStub::customSize = 10;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/timeout").getBody("val", &val);
    expectEq(val.c_str(), "", "timeout in non-chunked returns empty");
  }

  // Non-chunked large buffer (> BUF_SIZE)
  std::string largePayload(700, 'X');
  std::string largeJson = "{\"large\":\"" + largePayload + "\"}";
  MockDirectStream largeStream(largeJson);
  HttpClientStub::reset();
  HttpClientStub::customStream = &largeStream;
  HttpClientStub::customSize = static_cast<int>(largeJson.size());
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/large").getBody("", &val);
    expectEqInt(static_cast<long long>(val.length()), static_cast<long long>(largeJson.size()), "large stream read length 700");
  }

  // Chunked stream with extensions (;) and empty hex lines
  std::string chunkedExtData = "\r\n13;ext=test\r\n{\"msg\":\"WORLD\"}\r\n0\r\n\r\n";
  MockDirectStream chunkedExtStream(chunkedExtData);
  HttpClientStub::reset();
  HttpClientStub::customStream = &chunkedExtStream;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/chunked").getBody("msg", &val);
    expectEq(val.c_str(), "WORLD", "chunked with extensions read WORLD");
  }

  // Chunked stream timeout in chunk header
  MockDirectStream chunkTimeoutHeader;
  chunkTimeoutHeader.availableTimesOut = true;
  HttpClientStub::reset();
  HttpClientStub::customStream = &chunkTimeoutHeader;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/chunk_to_hdr").getBody("msg", &val);
    expectEq(val.c_str(), "", "chunk timeout header returns empty");
  }

  // Chunked stream timeout in chunk data
  MockDirectStream chunkTimeoutData("5\r\n");
  HttpClientStub::reset();
  HttpClientStub::customStream = &chunkTimeoutData;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/chunk_to_data").getBody("msg", &val);
    expectEq(val.c_str(), "", "chunk timeout data returns empty");
  }

  // Chunk larger than BUF_SIZE (triggering toRead > BUF_SIZE - _len and refill loop completion)
  std::string bigChunkVal(600, 'Z');
  std::string bigChunkPayload = "{\"data\":\"" + bigChunkVal + "\"}";
  char hexBuf[16];
  snprintf(hexBuf, sizeof(hexBuf), "%x\r\n", static_cast<unsigned int>(bigChunkPayload.size()));
  std::string bigChunkData = std::string(hexBuf) + bigChunkPayload + "\r\n0\r\n\r\n";
  MockDirectStream bigChunkStream(bigChunkData);
  HttpClientStub::reset();
  HttpClientStub::customStream = &bigChunkStream;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/big_chunk").getBody("", &val);
    expectEqInt(static_cast<long long>(val.length()), static_cast<long long>(bigChunkPayload.size()), "big chunk read length 600");
  }

  // Chunked stream with simulateZeroBytesRead
  MockDirectStream zeroBytesStream("10\r\n{\"data\":\"HI\"}\r\n0\r\n\r\n");
  zeroBytesStream.simulateZeroBytesRead = true;
  HttpClientStub::reset();
  HttpClientStub::customStream = &zeroBytesStream;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/zero_bytes").getBody("data", &val);
    expectEq(val.c_str(), "", "zero bytes read causes eof");
  }

  // Chunked stream with partial read (avail < toRead)
  MockDirectStream partialStream("10\r\n{\"data\":\"HI\"}\r\n0\r\n\r\n");
  partialStream.readBytesLimit = 2;
  HttpClientStub::reset();
  HttpClientStub::customStream = &partialStream;
  HttpClientStub::customSize = -1;
  {
    ESP32HTTPClient client("https://example.com");
    String val;
    client.get("/partial").getBody("data", &val);
    expectEq(val.c_str(), "HI", "partial chunk read available");
  }

  HttpClientStub::reset();
}

void testSoap11RequestFormatting() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetPriceResponse><Price>99.95</Price></GetPriceResponse></soap:Body></soap:Envelope>");

