PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  ESP32HTTPClient client("https://example.com");
  float price = 0.0f;
  {
    client.soap("/ws")
        .soapAction("http://example.org/GetPrice")
        .body("<m:GetPrice xmlns:m=\"http://example.org\"><m:Item>ESP32</m:Item></m:GetPrice>")
        .getBody("Price", &price);
  }

  expectEq(HttpClientStub::lastMethod, "POST", "SOAP should use POST method");
  expectEq(HttpClientStub::lastUrl, "https://example.com/ws", "SOAP url");

  bool foundContentType = false;
  bool foundSoapAction = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Content-Type" && h.second == "text/xml; charset=utf-8") {
      foundContentType = true;
    }
    if (h.first == "SOAPAction" && h.second == "\"http://example.org/GetPrice\"") {
      foundSoapAction = true;
    }
  }
  expectTrue(foundContentType, "SOAP 1.1 Content-Type must be text/xml; charset=utf-8");
  expectTrue(foundSoapAction, "SOAP 1.1 must send quoted SOAPAction header");

  std::string expectedPayload = "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><m:GetPrice xmlns:m=\"http://example.org\"><m:Item>ESP32</m:Item></m:GetPrice></soap:Body></soap:Envelope>";
  expectEq(HttpClientStub::lastPayload, expectedPayload, "SOAP 1.1 Envelope payload");
  expectNear(price, 99.95, 0.01, "Parsed price from response");
}

void testSoap11HeaderAndEmptyAction() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><Result>OK</Result></Body></Envelope>");

  ESP32HTTPClient client("https://example.com");
  char result[16] = {0};
  {
    client.soap("/service")
        .headerXml("<Auth><Token>12345</Token></Auth>")
        .body("<Ping/>")
        .getBody("Result", result);
  }

  bool foundSoapAction = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "SOAPAction" && h.second == "\"\"") {
      foundSoapAction = true;
    }
  }
  expectTrue(foundSoapAction, "Empty SOAPAction formatted as \"\"");
  expectTrue(HttpClientStub::lastPayload.find("<soap:Header><Auth><Token>12345</Token></Auth></soap:Header>") != std::string::npos, "Envelope contains Header XML");
  expectEq(result, "OK", "Result parsed correctly");
}

void testSoap12RequestFormatting() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\"><soap12:Body><GetPriceResponse><Price>149.50</Price></GetPriceResponse></soap12:Body></soap12:Envelope>");

  ESP32HTTPClient client("https://example.com");
  double price = 0.0;
  {
    client.soap("/ws")
        .version(SOAP_1_2)
        .action("http://example.org/GetPrice")
        .body("<m:GetPrice xmlns:m=\"http://example.org\"><m:Item>ESP32-S3</m:Item></m:GetPrice>")
        .getBody("Price", &price);
  }

  bool foundContentType = false;
  bool foundSoapAction = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Content-Type" && h.second == "application/soap+xml; charset=utf-8; action=\"http://example.org/GetPrice\"") {
      foundContentType = true;
    }
    if (h.first == "SOAPAction") {
      foundSoapAction = true;
    }
  }
  expectTrue(foundContentType, "SOAP 1.2 Content-Type includes action parameter");
  expectTrue(!foundSoapAction, "SOAP 1.2 must NOT send SOAPAction HTTP header");

  std::string expectedPayload = "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap12:Body><m:GetPrice xmlns:m=\"http://example.org\"><m:Item>ESP32-S3</m:Item></m:GetPrice></soap12:Body></soap12:Envelope>";
  expectEq(HttpClientStub::lastPayload, expectedPayload, "SOAP 1.2 Envelope payload");
  expectNear(price, 149.50, 0.01, "Parsed price from SOAP 1.2 response");
}

void testSoap12HeaderAndEmptyAction() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\"><soap12:Body><Status>Online</Status></soap12:Body></soap12:Envelope>");

  ESP32HTTPClient client("https://example.com");
  client.setSoapVersion(SOAP_1_2);
  expectEqInt(client.getSoapVersion(), SOAP_1_2, "client getSoapVersion is SOAP_1_2");

  String status;
  {
    client.soap("/v2")
        .setVersion(SOAP_1_2)
        .headerXml("<Sec>key</Sec>")
        .body("<Check/>")
        .getBody("Status", &status);
  }

  bool foundContentType = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Content-Type" && h.second == "application/soap+xml; charset=utf-8") {
      foundContentType = true;
    }
  }
  expectTrue(foundContentType, "SOAP 1.2 Content-Type without action parameter when empty");
  expectTrue(HttpClientStub::lastPayload.find("<soap12:Header><Sec>key</Sec></soap12:Header>") != std::string::npos, "SOAP 1.2 Header XML present");
  expectEq(status.str(), "Online", "Status extracted");
}

void testSoapRawEnvelopeOverride() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<r><val>42</val></r>");

  ESP32HTTPClient client("https://example.com");
  int val = 0;
  {
    client.soap("/custom")
        .rawEnvelope("<CustomEnvelope><CustomBody>123</CustomBody></CustomEnvelope>")
        .getBody("val", &val);
  }

  expectEq(HttpClientStub::lastPayload, "<CustomEnvelope><CustomBody>123</CustomBody></CustomEnvelope>", "raw envelope sent as-is");
  expectEqInt(val, 42, "val parsed");
}

void testSoapResponseParsingTypes() {
  std::string xml =
      "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n"
      "<!-- This is a sample response -->\n"
      "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ws=\"http://ws.example.com\">\n"
      "  <soapenv:Header>\n"
      "    <ws:TransactionId>TX-987654</ws:TransactionId>\n"
      "  </soapenv:Header>\n"
      "  <soapenv:Body>\n"
      "    <ws:GetDataResponse>\n"
      "      <ws:Count>150</ws:Count>\n"
      "      <ws:Timestamp>1726900000</ws:Timestamp>\n"
      "      <ws:Ratio>3.14159</ws:Ratio>\n"
      "      <ws:Active>true</ws:Active>\n"
      "      <ws:Name>ESP32-Node</ws:Name>\n"
      "      <ws:Data><![CDATA[Raw <embedded> & unescaped data]]></ws:Data>\n"
      "      <ws:Escaped>Entities &amp; &lt;brackets&gt; &quot;quotes&quot; &apos;apos&apos; &#65;</ws:Escaped>\n"
      "      <ws:EmptyTag/>\n"
      "    </ws:GetDataResponse>\n"
      "  </soapenv:Body>\n"
      "</soapenv:Envelope>";

  StringStream stream(xml);
  BufferedStreamReader reader(&stream);

  int count = 0;
  long timestamp = 0;
  float ratio = 0.0f;
  bool active = false;
  char name[32] = {0};
  String txId;
  String cdata;
  String escaped;
  String emptyVal = "initial";

