PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  std::vector<ResponseBinding> bindings = {
      {"Count", &count, TYPE_INT, 0},
      {"Timestamp", &timestamp, TYPE_LONG, 0},
      {"Ratio", &ratio, TYPE_FLOAT, 0},
      {"Active", &active, TYPE_BOOL, 0},
      {"Name", name, TYPE_STRING, sizeof(name)},
      {"Header.TransactionId", &txId, TYPE_ARDUINO_STRING, 0},
      {"Data", &cdata, TYPE_ARDUINO_STRING, 0},
      {"Escaped", &escaped, TYPE_ARDUINO_STRING, 0},
      {"EmptyTag", &emptyVal, TYPE_ARDUINO_STRING, 0},
  };

  SoapFault fault;
  String rawXml;
  SoapRequest::parseXmlWithBindings(reader, bindings, &fault, &rawXml);

  expectEqInt(count, 150, "Count parsed as int");
  expectEqInt(timestamp, 1726900000L, "Timestamp parsed as long");
  expectNear(ratio, 3.14159, 0.0001, "Ratio parsed as float");
  expectTrue(active, "Active parsed as bool");
  expectEq(name, "ESP32-Node", "Name parsed as char buffer");
  expectEq(txId.str(), "TX-987654", "Dotted path Header.TransactionId parsed");
  expectEq(cdata.str(), "Raw <embedded> & unescaped data", "CDATA content parsed");
  expectEq(escaped.str(), "Entities & <brackets> \"quotes\" 'apos' A", "XML entities decoded");
  expectEq(emptyVal.str(), "", "Empty self-closing tag binds empty string");
  expectTrue(!fault.matched, "No fault in successful response");
  expectTrue(rawXml.length() > 100, "Raw XML captured");
}

void testSoap11FaultHandling() {
  HttpClientStub::reset();
  std::string faultXml =
      "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">"
      "  <soap:Body>"
      "    <soap:Fault>"
      "      <faultcode>soap:Server</faultcode>"
      "      <faultstring>Internal error processing request</faultstring>"
      "      <faultactor>http://example.com/order-service</faultactor>"
      "      <detail>Database connection timeout</detail>"
      "    </soap:Fault>"
      "  </soap:Body>"
      "</soap:Envelope>";
  HttpClientStub::setResponse(500, faultXml);

  ESP32HTTPClient client("https://example.com");
  SoapFault fault;
  bool faultCbFired = false;
  bool errorCbFired = false;
  int errCode = 0;

  {
    client.soap("/ws")
        .soapAction("DoFail")
        .body("<Fail/>")
        .getFault(&fault)
        .onFault([&](const SoapFault& f) {
          faultCbFired = true;
          expectEq(f.faultCode.str(), "soap:Server", "Callback faultCode");
          expectEq(f.faultString.str(), "Internal error processing request", "Callback faultString");
        })
        .onError([&](int code, const char* msg) {
          errorCbFired = true;
          errCode = code;
        });
  }

  expectTrue(fault.matched, "Fault matched");
  expectEq(fault.faultCode.str(), "soap:Server", "Fault code extracted");
  expectEq(fault.faultString.str(), "Internal error processing request", "Fault string extracted");
  expectEq(fault.faultActor.str(), "http://example.com/order-service", "Fault actor extracted");
  expectEq(fault.detail.str(), "Database connection timeout", "Fault detail extracted");
  expectTrue(faultCbFired, "onFault callback fired");
  expectTrue(errorCbFired, "onError callback fired on 500");
  expectEqInt(errCode, 500, "Error code is 500");
}

void testSoap12FaultHandling() {
  HttpClientStub::reset();
  std::string faultXml =
      "<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:rpc=\"http://www.w3.org/2003/05/soap-rpc\">"
      "  <env:Body>"
      "    <env:Fault>"
      "      <env:Code>"
      "        <env:Value>env:Sender</env:Value>"
      "      </env:Code>"
      "      <env:Reason>"
      "        <env:Text xml:lang=\"en-US\">Invalid argument supplied</env:Text>"
      "      </env:Reason>"
      "      <env:Node>http://example.com/node1</env:Node>"
      "      <env:Role>http://example.com/role1</env:Role>"
      "      <env:Detail>Parameter 'id' cannot be negative</env:Detail>"
      "    </env:Fault>"
      "  </env:Body>"
      "</env:Envelope>";
  HttpClientStub::setResponse(500, faultXml);

  ESP32HTTPClient client("https://example.com");
  SoapFault fault;
  bool faultCbFired = false;

  {
    client.soap("/v2")
        .version(SOAP_1_2)
        .body("<GetItem id=\"-1\"/>")
        .getFault(&fault)
        .onFault([&](const SoapFault& f) {
          faultCbFired = true;
        });
  }

  expectTrue(fault.matched, "SOAP 1.2 Fault matched");
  expectEq(fault.faultCode.str(), "env:Sender", "SOAP 1.2 Code/Value extracted");
  expectEq(fault.faultString.str(), "Invalid argument supplied", "SOAP 1.2 Reason/Text extracted");
  expectEq(fault.faultActor.str(), "http://example.com/node1", "SOAP 1.2 Node extracted");
  expectEq(fault.detail.str(), "Parameter 'id' cannot be negative", "SOAP 1.2 Detail extracted");
  expectTrue(faultCbFired, "SOAP 1.2 onFault callback fired");
}

void testSoapHeadersAndAuth() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><Res>1</Res></Body></Envelope>");
  HttpClientStub::setResponseHeaders({{"X-Server-Id", "srv-42"}});

  ESP32HTTPClient client("https://example.com");
  client.basic("admin", "secret123");
  client.apiKey("X-API-Key", "api-val-99");
  client.cookie("session", "xyz");

  int res = 0;
  String serverId;
  {
    client.soap("/secure")
        .body("<Req/>")
        .getBody("Res", &res)
        .getHeader("X-Server-Id", &serverId);
  }

  bool foundAuth = false;
  bool foundApiKey = false;
  bool foundCookie = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Authorization" && h.second == "Basic YWRtaW46c2VjcmV0MTIz") foundAuth = true;
    if (h.first == "X-API-Key" && h.second == "api-val-99") foundApiKey = true;
    if (h.first == "Cookie" && h.second == "session=xyz") foundCookie = true;
  }
  expectTrue(foundAuth, "Basic auth header sent with SOAP");
  expectTrue(foundApiKey, "API key header sent with SOAP");
  expectTrue(foundCookie, "Cookie sent with SOAP");
  expectEqInt(res, 1, "Result parsed");
  expectEq(serverId.str(), "srv-42", "Response header captured");
}

void testSoapPathAndQueryParams() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><Data>10</Data></Body></Envelope>");

