PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  ESP32HTTPClient client("https://example.com");
  int data = 0;
  {
    client.soap("/services/{serviceId}/endpoint")
        .path("serviceId", 456)
        .query("tenant", "acme")
        .query("debug", true)
        .body("<Fetch/>")
        .getBody("Data", &data);
  }

  expectEq(HttpClientStub::lastUrl, "https://example.com/services/456/endpoint?tenant=acme&debug=true", "URL with path and query parameters");
  expectEqInt(data, 10, "Data parsed");
}

void testSoapRetryAndObservability() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(-1, ""); // first attempt fails

  ESP32HTTPClient client("https://example.com");
  bool obsFired = false;
  client.onObservability([&](const ObservabilityMetrics& m) {
    obsFired = true;
    expectTrue(m.retries >= 1, "Retries recorded");
  });

  client.soap("/retry")
      .retry(1)
      .body("<Ping/>")
      .getBody("Ignored", (int*)nullptr);

  expectTrue(obsFired, "Observability callback fired on SOAP request");
  expectEqInt(client.getStatusCode(), -1, "Status code after retry failure");
}

void testSoapMoveConstructor() {
  ESP32HTTPClient client("https://example.com");
  SoapRequest req1(&client, "/move", SOAP_1_2);
  req1.soapAction("MyAction").body("<Ping/>");

  SoapRequest req2(std::move(req1));
  expectTrue(req1._executed, "req1 marked executed after move");
  expectEq(req2._soapAction.str(), "MyAction", "req2 preserved soapAction");
  expectEqInt(req2._version, SOAP_1_2, "req2 preserved version");
  req2._executed = true;
}

void testSoapClientSingleParamOnError() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(404, "<Envelope><Body><Fault><faultcode>404</faultcode><faultstring>Not Found</faultstring></Fault></Body></Envelope>");

  ESP32HTTPClient client("https://example.com");
  int capturedCode = 0;
  client.onError([&capturedCode](int code) {
    capturedCode = code;
  });

  client.soap("/notfound").body("<Req/>");
  expectEqInt(capturedCode, 404, "Client single-parameter onError callback fired for SOAP");
}

void testSoapAllHeaderTypes() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><Val>42</Val></Body></Envelope>");
  HttpClientStub::setResponseHeaders({
      {"X-Int", "10"},
      {"X-Long", "999999"},
      {"X-Float", "12.34"},
      {"X-Double", "56.789"},
      {"X-Bool", "true"},
      {"X-Char", "TestChar"}
  });

  ESP32HTTPClient client("https://example.com");
  int hInt = 0;
  long hLong = 0;
  float hFloat = 0.0f;
  double hDouble = 0.0;
  bool hBool = false;
  char hChar[16] = {0};

  client.soap("/headers")
      .body("<Ping/>")
      .getHeader("X-Int", &hInt)
      .getHeader("X-Long", &hLong)
      .getHeader("X-Float", &hFloat)
      .getHeader("X-Double", &hDouble)
      .getHeader("X-Bool", &hBool)
      .getHeader("X-Char", hChar);

  expectEqInt(hInt, 10, "SOAP getHeader int");
  expectEqInt(hLong, 999999L, "SOAP getHeader long");
  expectNear(hFloat, 12.34, 0.01, "SOAP getHeader float");
  expectNear(hDouble, 56.789, 0.001, "SOAP getHeader double");
  expectTrue(hBool, "SOAP getHeader bool");
  expectEq(hChar, "TestChar", "SOAP getHeader char[]");
}

void testSoapCustomPort() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><R>1</R></Body></Envelope>");
  ESP32HTTPClient client("http://test.com/ws", 8080);
  int r = 0;
  client.soap("/action").body("<P/>").getBody("R", &r);

  expectEq(HttpClientStub::lastUrl, "http://test.com:8080/ws/action", "SOAP url with custom port and base path");
}

void testSoapCallbacksAndObservability() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><R>OK</R></Body></Envelope>");

  ESP32HTTPClient client("https://example.com");
  bool clientSuccessFired = false;
  bool clientResponseFired = false;
  bool reqSuccessFired = false;
  bool reqResponseFired = false;

  client.onSuccess([&](int code) { clientSuccessFired = true; });
  client.onResponse([&](int code) { clientResponseFired = true; });

  client.soap("/test")
      .body("<Req/>")
      .onSuccess([&](int code) { reqSuccessFired = true; })
      .onResponse([&](int code) { reqResponseFired = true; });

  expectTrue(clientSuccessFired, "client onSuccess fired for SOAP");
  expectTrue(clientResponseFired, "client onResponse fired for SOAP");
  expectTrue(reqSuccessFired, "request onSuccess fired for SOAP");
  expectTrue(reqResponseFired, "request onResponse fired for SOAP");
}

void testSoapExecuteNullClient() {
  SoapRequest req(nullptr, "/null");
  req.execute();
  expectTrue(req._executed, "executing with null client is a safe no-op");
}

void testSoapEdgeCases() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<Envelope><Body><Data><![CDATA[embedded ] and ]] bracket]]></Data><Hex>&#x42;</Hex><Dec>&#67;</Dec></Body></Envelope>");

  ESP32HTTPClient client("https://example.com");
  String bodyStr = "<SampleBody/>";
  String headerStr = "<SampleHeader/>";
  String rawStr = "<CustomRawEnvelope/>";

  int singleParamCode = 0;
  String dataVal;
  String hexVal;
  String decVal;

  client.soap("/edge")
      .headerXml(headerStr)
      .body(bodyStr)
      .onError([&singleParamCode](int code) { singleParamCode = code; })
      .getBody("Data", &dataVal)
      .getBody("Hex", &hexVal)
      .getBody("Dec", &decVal);

  expectEq(dataVal.str(), "embedded ] and ]] bracket", "CDATA with nested brackets");
  expectEq(hexVal.str(), "B", "Hex numeric entity &#x42;");
  expectEq(decVal.str(), "C", "Dec numeric entity &#67;");

  // Test raw envelope with String overload
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "<r/>");
  client.soap("/rawString").rawEnvelope(rawStr);
  expectEq(HttpClientStub::lastPayload, "<CustomRawEnvelope/>", "rawEnvelope with String");
}
}

int main() {
  runSuite("AddParamFormatting", testAddParamFormatting);
  runSuite("ExecuteBuildsUrlAndPayload", testExecuteBuildsUrlAndPayload);
  runSuite("MethodAliases", testMethodAliases);
  runSuite("ParseResponseBindsTypes", testParseResponseBindsTypes);
  runSuite("ParseNestedJSON", testParseNestedJSON);
  runSuite("ParseNestedJSONMissingFields", testParseNestedJSONMissingFields);
  runSuite("ParseRawArrayJSON", testParseRawArrayJSON);
  runSuite("UnixTimestampFetch", testUnixTimestampFetch);
  runSuite("ClientConfiguration", testClientConfiguration);
  runSuite("AllHttpMethods", testAllHttpMethods);
  runSuite("AutoRetry", testAutoRetry);
  runSuite("ChunkedTransferEncoding", testChunkedTransferEncoding);
  runSuite("LargePayloadRefill", testLargePayloadRefill);
  runSuite("MoreParseEdgeCases", testMoreParseEdgeCases);
  runSuite("ParseEmptyObjectOrArray", testParseEmptyObjectOrArray);
  runSuite("AddParamAdvanced", testAddParamAdvanced);
  runSuite("StringAndNumericTypesInParams", testStringAndNumericTypesInParams);
  runSuite("ExecuteCustomPortWithPath", testExecuteCustomPortWithPath);
  runSuite("ParseEscapedStringsSimple", testParseEscapedStringsSimple);
  runSuite("SkipValueAdvanced", testSkipValueAdvanced);
  runSuite("MoveConstructor", testMoveConstructor);
  runSuite("ParsePrimitiveTypes", testParsePrimitiveTypes);
  runSuite("AuthBearer", testAuthBearer);
  runSuite("AuthBasic", testAuthBasic);
  runSuite("AuthApiKey", testAuthApiKey);
  runSuite("AuthCookie", testAuthCookie);
  runSuite("Observability", testObservability);
  runSuite("AuthEdgeCases", testAuthEdgeCases);
  runSuite("QueryParameters", testQueryParameters);
  runSuite("PathParameters", testPathParameters);
  runSuite("PathAndQueryCombined", testPathAndQueryCombined);
  runSuite("PathEdgeCases", testPathEdgeCases);
  runSuite("RuntimeUrlChange", testRuntimeUrlChange);
  runSuite("Timeout", testTimeout);
  runSuite("MaxRetry", testMaxRetry);
  runSuite("ErrorHandlingAndMessages", testErrorHandlingAndMessages);
  runSuite("Callbacks", testCallbacks);
  runSuite("StructSerializationToJson", testStructSerializationToJson);
  runSuite("StructDeserializationFromJson", testStructDeserializationFromJson);
  runSuite("StructMissingFieldsAndDefaults", testStructMissingFieldsAndDefaults);
  runSuite("StructNullFields", testStructNullFields);
  runSuite("StructRequestBody", testStructRequestBody);
  runSuite("StructResponseBodyGetBody", testStructResponseBodyGetBody);
  runSuite("StructCustomAndExternalMapping", testStructCustomAndExternalMapping);
  runSuite("GetHeaderString", testGetHeaderString);
  runSuite("GetHeaderCharArray", testGetHeaderCharArray);
  runSuite("GetHeaderNumericAndBool", testGetHeaderNumericAndBool);
  runSuite("GetHeaderCaseInsensitiveAndMissing", testGetHeaderCaseInsensitiveAndMissing);
  runSuite("GetHeaderCombinedWithGetBody", testGetHeaderCombinedWithGetBody);
  runSuite("GetHeaderRetries", testGetHeaderRetries);
  runSuite("GetHeaderMoveConstructor", testGetHeaderMoveConstructor);
  runSuite("GetHeaderAllHttpMethods", testGetHeaderAllHttpMethods);
  runSuite("Base64EncodeEdgeCases", testBase64EncodeEdgeCases);
  runSuite("CookieNullParams", testCookieNullParams);
  runSuite("ErrorToStringAllCodes", testErrorToStringAllCodes);
  runSuite("ClientAndRequestSingleParamOnError", testClientAndRequestSingleParamOnError);
  runSuite("ClientErrorCallbackTriggered", testClientErrorCallbackTriggered);
  runSuite("RetryWithClientHeadersAndBody", testRetryWithClientHeadersAndBody);
  runSuite("ExecuteNullClient", testExecuteNullClient);
  runSuite("RawJsonRootObjectAndEscapedStrings", testRawJsonRootObjectAndEscapedStrings);
  runSuite("ParsePrimitiveEdgeCases", testParsePrimitiveEdgeCases);
  runSuite("ArrayBindingsAdvanced", testArrayBindingsAdvanced);
  runSuite("SkipValueObjectAndArray", testSkipValueObjectAndArray);
  runSuite("MalformedJsonHandling", testMalformedJsonHandling);
  runSuite("StructNullStringField", testStructNullStringField);
  runSuite("SkipValueEscapedString", testSkipValueEscapedString);
  runSuite("ObjectWithNestedArrayChildBinding", testObjectWithNestedArrayChildBinding);
  runSuite("BufferedStreamReaderDirect", testBufferedStreamReaderDirect);
  runSuite("Soap11RequestFormatting", testSoap11RequestFormatting);
  runSuite("Soap11HeaderAndEmptyAction", testSoap11HeaderAndEmptyAction);
  runSuite("Soap12RequestFormatting", testSoap12RequestFormatting);
  runSuite("Soap12HeaderAndEmptyAction", testSoap12HeaderAndEmptyAction);
  runSuite("SoapRawEnvelopeOverride", testSoapRawEnvelopeOverride);
  runSuite("SoapResponseParsingTypes", testSoapResponseParsingTypes);
  runSuite("Soap11FaultHandling", testSoap11FaultHandling);
  runSuite("Soap12FaultHandling", testSoap12FaultHandling);
  runSuite("SoapHeadersAndAuth", testSoapHeadersAndAuth);
  runSuite("SoapPathAndQueryParams", testSoapPathAndQueryParams);
  runSuite("SoapRetryAndObservability", testSoapRetryAndObservability);
  runSuite("SoapMoveConstructor", testSoapMoveConstructor);
  runSuite("SoapClientSingleParamOnError", testSoapClientSingleParamOnError);
  runSuite("SoapAllHeaderTypes", testSoapAllHeaderTypes);
  runSuite("SoapCustomPort", testSoapCustomPort);
  runSuite("SoapCallbacksAndObservability", testSoapCallbacksAndObservability);
  runSuite("SoapExecuteNullClient", testSoapExecuteNullClient);
  runSuite("SoapEdgeCases", testSoapEdgeCases);

  const int suitesFailed = suitesRun - suitesPassed;
  const double suitePassRate = suitesRun > 0 ? (100.0 * static_cast<double>(suitesPassed) / static_cast<double>(suitesRun)) : 0.0;
  const double checkPassRate = checks > 0 ? (100.0 * static_cast<double>(passedChecks) / static_cast<double>(checks)) : 0.0;

  std::cout << "\n=== Test Summary ===\n";
  std::cout << "Suites: " << suitesRun << " total | " << suitesPassed << " passed | " << suitesFailed << " failed\n";
  std::cout << "Checks: " << checks << " total | " << passedChecks << " passed | " << failures << " failed\n";
  std::cout << std::fixed << std::setprecision(1);
  std::cout << "Pass rate: " << suitePassRate << "% suites | " << checkPassRate << "% checks\n";

  if (failures == 0) {
    std::cout << "All unit tests passed.\n";
    return 0;
  }

  std::cerr << failures << " test(s) failed.\n";
  return 1;
}
